#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Wed Jun  5 20:50:07 2024

add_design "E:/FPGA/Pango_ddr3_axi_demo/ddr3_ctrl.v"
add_design E:/FPGA/Pango_ddr3_axi_demo/ipcore/ddr3_ip/ddr3_ip.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ddr3_ctrl
add_design "E:/FPGA/Pango_ddr3_axi_demo/ddr3_axi_test.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ddr3_axi_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ddr3_axi_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
add_constraint "E:/FPGA/Pango_ddr3_axi_demo/Pango_ddr3_axi_demo.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ddr3_axi_test
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
add_fic "E:/FPGA/Pango_ddr3_axi_demo/synthesize/ddr3_axi_test_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ddr3_axi_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
